## Project Name: Olympics Analysis

- Sports goes into entertainment category as far as viewers are concerned.
- Olympic athletes are considered as benchmarks in regards with their Strength, Agility and Intelligence.

### Project goal:
- To explore a dataset on the modern Summer Olympic Games - Athens data from 1896 to Rio 2016.
- In this project, I investigate on the results and understand trends of Olympics results. 
- Answer some common questions about the Summer Olympics.

### Dataset:
- Dataset have records at an individual Athlete competing in an individual Olympic events. 
- Columns as Name, Age, Medal_Won, Game, Year, and so on.

### Using summer olympics dataset we try to find out following questions answer:

### Phase 1: Data Collection

 ##### We are using two tables which are available at MySQL database:
 - olympics_history table where each row corresponds to an individual athlete competing in an individual Olympic event.
 - olympics_history_noc_regions contains NOC(National Olympic Committee  a 3-letter code) which helps us to add country information and its correspondion region from its NOC code.

In [108]:
# importing Basic libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### Phase 2: Data Understanding

In [109]:
# Connecting to MySql Database
import mysql.connector
mydb=mysql.connector.connect(
host="localhost",
user="root",
password="Sangeeta@4820",
use_pure=True)

In [118]:
query1 = '''SELECT * FROM Olympics.olympics_history'''

In [119]:
olympics_history_df = pd.read_sql_query(query, mydb)

In [120]:
olympics_history_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24,180,80,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NA
1,2,A Lamusi,M,23,170,60,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NA
2,3,Gunnar Nielsen Aaby,M,24,NA,NA,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NA
3,4,Edgar Lindenau Aabye,M,34,NA,NA,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21,185,82,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NA

In [121]:
query2 ='''SELECT * FROM Olympics.olympics_history_noc_regions'''

In [122]:
olympics_history_noc_regions_df = pd.read_sql_query(query2, mydb)

In [124]:
olympics_history_noc_regions_df.head()

   NOC       region                 notes
0  AFG  Afghanistan
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania
3  ALG      Algeria
4  AND      Andorra

### Phase 3: Data Understanding

In [144]:
query='''
SELECT COLUMN_NAME
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME = 'olympics_history'
LIMIT 15
'''

In [145]:
olympics_histoty_data = pd.read_sql_query(query, mydb)

In [146]:
olympics_histoty_data

   COLUMN_NAME
0          Age
1         City
2        Event
3        Games
4       Height
5           ID
6        Medal
7         Name
8          NOC
9       Season
10         Sex
11       Sport
12        Team
13      Weight
14        Year

In [115]:
query = '''
            SELECT 
                Name AS name,
                Sex AS sex,
                Height AS height
            FROM 
                Olympics.olympics_history 
            WHERE 
                Year = (SELECT 
                            min(Year)
                        FROM Olympics.olympics_history
                        )
        '''

In [116]:
data = pd.read_sql_query(query, mydb)

In [117]:
data

              nameakdjfkajdfakjdfa sex height
0             Arthur Charles Blake   M     NA
1             Arthur Charles Blake   M     NA
2        Conrad Helmut Fritz Bcker   M     NA
3        Conrad Helmut Fritz Bcker   M     NA
4        Conrad Helmut Fritz Bcker   M     NA
..                             ...  ..    ...
212                 Thomas Xenakis   M     NA
213  Jules Alexis "Louis"" Zutter"   M     NA
214  Jules Alexis "Louis"" Zutter"   M     NA
215  Jules Alexis "Louis"" Zutter"   M     NA
216  Jules Alexis "Louis"" Zutter"   M     NA

[217 rows x 3 columns]

In [104]:
df.Year.min()

1896

In [76]:
nan_data= df.replace('NA', np.nan)

In [77]:
nan_data.isnull().sum()

ID             0
Name           0
Sex            0
Age            0
Height     51402
Weight     54074
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     222153
dtype: int64